<?php
$a[] = "Γκρίτζαλης Στέφανος";
$a[] = "Ηλιάδης Άγης";
$a[] = "Κωτσάκης Σπύρος";
$a[] = "Λουκής Ευριπίδης";
$a[] = "Μήτρου Λίλιαν";
$a[] = "Σκιάνης Χαράλαμπος";
$a[] = "Βουγιούκας Δημοσθένης";
$a[] = "Καβαλλιεράτου Εργίνα";
$a[] = "Καμπουράκης Γεώργιος";
$a[] = "Κοκολάκης Σπύρος";
$a[] = "Κορμέντζας Γεώργιος";
$a[] = "Μαραγκουδάκης Εμμανουήλ";
$a[] = "Σταματάτος Ευστάθιος";
$a[] = "Χαραλαμπίδης Ιωάννης";
$a[] = "Καλλίγερος Εμμανουήλ";
$a[] = "Καπόρης Αλέξιος";
$a[] = "Καρύδα Μαρία";
$a[] = "Κωνσταντίνου Ελισάβετ";
$a[] = "Λερός Ασημάκης";
$a[] = "Ριζομυλιώτης Παναγιώτης";
$a[] = "Τζουραμάνης Θεόδωρος";
$a[] = "Γκουμόπουλος Χρήστος";
$a[] = "Δρόσος Δημήτριος";
$a[] = "Κοφινάς Γεώργιος";

$q = $_REQUEST["q"];


$hint = "";

//Εμφανιση προτεινομενου ονοματος
if ($q !== "") {
	
	$q= html_entity_decode($q);
    $q = strtolower($q);
    $len=strlen($q);
    foreach($a as $name) {
		
		
        if (stristr($q, substr($name, 0, $len))) {
            if ($hint === "") {
                $hint = $name;
            } else {
                $hint .= ", $name";
            }
        }
    }
}

// Output "no suggestion" if no hint was found or output correct values 
echo $hint === "" ? "no suggestion" : $hint;
?>